"identhub_bank_establishing_connection_text" = "Estableciendo conexión segura con su banco...";

"identhub_bank_iban_description" = "Introduzca el IBAN de su cuenta bancaria alemana. Desafortunadamente, las cuentas conjuntas no son compatibles. Sus datos están encriptados.";

"identhub_bank_iban_secured_text" = "Sus datos están encriptados.";

"identhub_bank_iban_title" = "Introduzca su IBAN";

"identhub_bank_payment_verification_description" = "Continúa firmando los documentos para finalizar tu proceso de identificación.";

"identhub_bank_payment_verification_title" = "Verificación del pago realizada con éxito";

"identhub_phone_transcation_detail_text" = "El ID de tu operación es %1$s\nAsegúrate de que es el mismo en el SMS que acabas de recibir.";

